tutorials/XiFluid/1D/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultValues
{
    b   1;
    T   300;
    U   (-1.5 0 0);
}

zones
{
    burnt
    {
        type        box;

        box         (0 -1 -1) (0.025 1 1);

        values
        {
            b   0;
            T   2000;
            U   (-10 0 0);
        }
    }
}

// ************************************************************************* //
